In [1]:
import pandas as pd

In [2]:
#1 Read titanic.csv into memory
data = pd.read_csv("titanic.csv")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [3]:
#2 Impute the missing values in "Age" using the median age of all passengers and store the result in a column called "Age_med".
med_age = data["Age"].median()
med_age = int(med_age)
data.insert(12,"Age_med",data["Age"].fillna(med_age).astype(int))

In [4]:
#verify that Age_med has no null values
data["Age_med"].isnull().sum()

0

In [5]:
#3 Impute the missing values in "Age" using the mean age of passengers of the same sex and store the result in a column called "Age_mean_sex".
##grouped = data.groupby("Sex")
##mean_male = grouped.get_group("male")["Age"].mean()
##mean_fem = grouped.get_group("female")["Age"].mean()
##mean_male = int(round(mean_male)) #should be 31, rounded to int to keep data type consistent
##mean_fem = int(round(mean_fem)) #should be 28, rounded for the same reason
data.insert(13,"Age_mean_sex",data.groupby('Sex', group_keys=False)["Age"].apply(lambda x: x.fillna(int(round(x.mean())))))
#just ignore the other code
#please

In [6]:
#verify that Age_mean_sex has no null values
data["Age_mean_sex"].isnull().sum()

0

In [7]:
#4 Impute the missing values in "Cabin" using a method of your choosing and store it in the original "Cabin" column.

In [8]:
data.fillna({"Cabin":"Unknown"}, inplace=True)

In [9]:
#Verify that Cabin no longer has any null values.

In [10]:
data["Cabin"].isnull().sum()

0

In [11]:
# Explain why you chose the method you used.
# We don't know, so it's "Unknown", but also it's no longer a null value anymore